app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("nombre_ap", "sexo", "peso", "nombre_am", "direccion_cp", "plan_alimenticio_id", "direccion_colonia", "fecha_nacimiento", "altura", "direccion_calle", "enfermedad_id", "ingestas_diarias", "direccion_cuidad", "email", "nombre_pila", "direccion_numero", "telefono", "password", "created_at", "updated_at") VALUES ('', NULL, 0.0, '', NULL, NULL, '', '2011-05-30', 0.0, '', NULL, 0, '', '', '', '', 0, '', '2011-05-30 07:30:57.743165', '2011-05-30 07:30:57.743165')

  def destroy
    @usuario = Usuario.find(params[:id])
    @usuario.destroy
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
DELETE FROM "usuarios" WHERE "usuarios"."id" = 1